rt
woman
shouldnt
complain
clean
hous
amp
man
alway
take
trash
boy
dat
bad
hoe
st
place
dawg
sbabylif
ever
fuck
bitch
start
cri
confus
shit
look
like
tranni
hear
might
true
told
ya
blow
faith
somebodi
still
sit
hate
anoth
got
much
go
caus
im
tire
big
come
us
skinni
girl
get
back
that
includ
fight
curv
everyon
lol
walk
convers
smh
gang
land
smoke
loser
yea
ig
thing
nigga
miss
whatev
love
cut
everyday
b
black
bottl
broke
cant
tell
noth
see
wont
chang
dont
even
suck
dick
video
bout
tip
toe
floor
pussi
lip
heaven
door
hit
met
gave
pill
need
spend
money
want
busi
old
new
id
say
would
excit
aint
murder
game
shut
your
done
stink
bitter
wrap
angri
bird
there
ju
meet
son
mane
ass
shot
lame
tear
clown
said
momma
cat
insid
favorit
nice
make
real
bodi
south
chick
em
thick
pimp
futur
voic
post
pictur
power
drug
quick
piec
call
drive
run
round
worst
send
guy
talk
trust
yall
cuf
never
bullet
da
pregnant
thank
god
young
music
probabl
twitter
gay
couldnt
wait
act
tonight
ima
steal
n
he
gone
took
movi
wanna
model
wouldnt
mind
school
didnt
deal
teacher
retweet
fag
femal
think
date
cute
stuff
woof
hot
scalli
lad
ask
kany
ye
u
bring
ur
side
know
gf
friend
swear
sole
eat
oreo
dish
one
gook
mayb
youll
better
red
niggah
could
pleas
use
complet
sentenc
emoji
scream
lmao
gt
sexi
shower
everi
eagl
pic
racist
yo
wood
push
faggot
ball
life
babi
monkey
damn
kill
way
bs
must
ring
ppl
kid
grow
fact
tattoo
nippl
bill
wow
lost
pierc
yeah
she
ok
rather
shell
work
queer
read
tweet
k
wasnt
funni
fr
whitethunduh
beaner
mexican
happi
birthday
nig
hell
john
paul
lil
ugli
bald
head
stop
makeup
weav
win
causewereguy
year
food
car
retard
doesnt
show
hella
anymor
chill
brought
cowboy
clicquotsuav
coleyce
spit
g
let
coupl
page
trick
shake
excus
full
second
miley
bc
emot
foh
loyal
idc
lick
check
th
ny
fan
stand
happen
ran
threw
okay
nude
hold
anyway
wrong
nobodi
type
dm
top
basebal
season
yanke
littl
stupid
realli
dead
seriou
tho
earli
night
worm
sound
day
pit
bull
fairi
aw
long
laker
hahaha
anyth
kiss
funnypicsdepot
play
soccer
cheat
wear
fat
finna
gotta
rule
cousin
jersey
thinkin
move
amo
pie
meat
slap
bruh
wit
treat
sweet
bag
sex
mom
right
came
eye
open
watch
shoulda
bday
roll
wcw
els
nah
throw
pass
glad
outta
bunch
jail
dumb
mad
fuckin
isnt
smart
wife
cuz
care
forc
relationship
first
singl
theonemissluu
white
drunk
blunt
bro
dude
around
world
parti
set
oomf
lot
save
captain
nose
boi
sox
leg
wish
brother
bet
dress
halloween
basic
gtfo
joebudden
scare
choke
women
bed
ha
well
oh
molli
ho
fix
refer
lmfao
beat
final
line
tf
record
vine
hahahaha
haha
naw
tape
cover
mixtap
ol
dirti
foot
yellow
flag
amaz
time
actin
stay
aliv
nation
special
smfh
wonder
keep
soft
mani
stfu
bye
dri
blame
gucci
drop
month
text
wat
lebronvuitton
without
daddi
issu
find
easi
cum
charli
sheen
major
respect
bae
twerk
cook
wtf
good
along
booti
everywher
updat
report
week
bum
field
def
best
tv
lmfaoooo
peopl
nigger
master
piss
past
slept
w
fam
feel
hick
america
mean
nasti
actual
choos
vibe
tri
di
af
tight
shirt
everybodi
may
beauti
r
purpl
playin
track
sum
seen
mine
kobe
forget
meant
least
mix
asian
whiteponyjr
coward
crippl
lmaoo
home
everyth
lowkey
quiet
sleep
weird
mention
weak
advic
quot
stripper
theyr
pop
doubl
beer
takin
aid
claim
hide
tree
drake
shoe
releas
ghetto
alon
austin
teach
expect
nake
lmaooo
toni
fuk
holi
chocol
laugh
follow
clearli
annoy
catch
worri
insecur
handl
share
hungri
problem
dese
sportscent
senior
brown
coach
steve
quit
team
guess
also
zero
strap
impress
simpl
anybodi
control
idk
blah
cuh
crazi
gonna
fine
dam
drink
c
later
longer
friday
yesterday
test
forev
voiceofdstreetz
tast
bobbi
live
ride
bar
sad
charact
death
bu
explain
help
jihadi
avi
togeth
expos
size
exactli
kim
near
protect
dope
girlfriend
aye
taught
beef
bottom
person
till
shanea
fucc
rich
homi
nicca
last
sunday
punch
face
strong
fresh
lt
someth
stank
nd
dark
blond
sever
seat
left
butt
straight
boss
corner
gettin
weekend
betta
street
lock
colleg
differ
stori
ratchet
name
idea
mr
thug
phone
marri
havent
posit
soul
bore
suppos
sometim
doubt
teeth
gold
dc
thot
across
known
lie
put
tryin
score
mouth
tht
huh
wack
knew
uh
ban
pay
dollar
rose
blue
window
fli
smack
gon
entir
media
mock
shi
hi
smile
dip
cracker
nfl
alreadi
karma
tea
gym
arrest
turn
idntwearcondom
argu
weed
public
cop
rapper
link
loud
tomorrow
barackobama
pretend
chees
give
ah
reason
photo
baddest
made
spook
ill
break
neck
sorri
savag
press
lildurk
screen
shoot
bowl
two
enjoy
color
contact
period
die
high
neva
sister
perfect
pretti
easili
behind
nip
histori
cool
sure
news
fox
etc
rn
browni
kind
someon
hurt
yah
thang
slope
fit
action
next
promis
fucker
celebr
local
saw
listen
sneak
childish
rememb
wop
omg
raw
french
nothin
free
write
panti
whole
water
fade
chase
kno
job
becom
wodaeeex
bite
albino
order
chines
ate
taco
lunch
soon
polit
view
whore
devil
away
children
word
cunt
ex
ive
feelin
ape
commun
yank
dad
snapchat
believ
fall
song
alright
foreign
dragon
gener
box
via
bear
wigger
unless
heart
lucki
uncl
account
imma
great
grandma
hey
found
draft
folk
war
zone
hilari
negro
dog
hillbilli
jesu
chief
chug
alot
tongu
bang
heard
candi
hope
ladi
number
eatin
either
dream
sold
sell
older
men
fool
prolli
leav
cup
hand
hair
went
woke
sir
hard
slit
funki
honkey
shout
yell
middl
wast
main
appl
sick
fed
yet
pick
shorti
room
wave
tie
accept
blind
late
tag
dyke
mama
creat
studi
correct
pound
cake
van
ik
porch
broken
bra
admit
sinc
thought
yr
super
boat
base
race
whip
club
timelin
justin
comment
million
search
chicken
redneck
fast
tupac
aka
summer
shape
wigga
florida
youv
slow
classi
footbal
shove
dirt
finger
chunki
student
callin
band
motherfuck
broad
road
giant
lookin
low
virgin
regular
luv
ole
titti
squad
marriag
chri
green
evil
burn
question
cooki
tryna
porn
feet
smell
end
gunna
respons
pull
light
morn
today
total
redskin
joke
flat
slut
cash
star
far
close
freak
vagina
root
settl
hater
youtub
cu
rip
apart
crib
skin
assum
lord
poor
whitey
latina
kardashian
twat
moment
rain
facebook
fa
tl
queen
fun
enough
wash
teabagg
state
tcot
teaparti
obama
syria
arent
fish
governor
baker
design
pain
gop
exist
pure
except
agre
court
truth
air
father
feed
aunt
mari
bean
california
whine
muslim
crack
allow
possibl
peni
boob
lose
self
bless
fake
child
fire
hairi
scari
sens
outsid
citi
ebola
earth
attent
wors
jig
royal
trend
mo
tha
mess
serv
instead
ruin
other
iu
hoosier
intern
card
jk
lesbian
sport
grade
liber
gov
isi
offer
calm
averag
spanish
remind
fob
beard
radio
twice
texa
niqqa
who
ticket
continu
iubb
finish
nba
indiana
though
usual
talkin
smash
focu
natur
knock
readi
shoutout
salut
case
west
orang
carri
tbt
scandal
decid
wall
deez
half
dump
dem
spic
butter
four
point
scale
player
shave
jeter
seri
price
joe
al
flex
earn
hr
sale
rest
bounc
michael
tank
mlb
three
ray
build
proud
la
weather
horribl
hors
hello
democrat
fair
network
mt
peac
anyon
famou
famili
x
hang
honki
wetback
ca
morningjo
prove
hood
niggaz
pornandroidiphoneipadsexxxx
part
babe
caught
rub
tit
asshol
japanes
orient
deep
wild
fist
loos
cream
wet
cock
small
teen
graduat
rate
min
presid
law
mike
vega
everytim
sing
rock
bud
plu
trip
visit
killer
smith
salad
crow
fck
coon
yep
tom
housewif
shitti
rd
needa
hop
trap
ugh
short
import
bullshit
rude
worth
mimi
nope
cours
stomach
yu
pose
vonshayeb
legend
sayin
challeng
relax
itsnotharold
laid
silli
bank
stadium
front
kinda
buy
bucket
honestli
snap
chat
shade
draw
nerv
dinner
nap
delet
what
wake
kinghorsedick
step
til
boyfriend
strip
mall
built
answer
class
de
chillin
east
unfollow
paid
ear
breath
attitud
hook
homeless
system
minut
freshman
warm
flappi
skill
alex
spot
stone
awesom
ion
fail
anim
alcohol
rais
idiot
none
goal
hun
sqquad
danc
jordan
zebra
irrelev
store
boosi
rape
church
absolut
polic
king
rice
hole
desper
whatevaittak
fill
ampamp
fo
trynna
equal
offici
flight
messi
derek
consid
caymariee
mf
serious
ctfu
interest
slide
male
support
heat
j
pant
grind
seem
corni
here
illeg
wana
djzeeti
hat
forgot
park
stick
goin
bare
dnt
afraid
commit
trade
neg
wassup
lay
buddi
normal
ad
train
extra
lmfaoo
juic
whoop
rap
opinion
huge
mental
friendlyasshl
lightskin
lmfaooo
nigguh
beyonc
neither
block
offend
circl
definit
hurri
mother
learn
spell
thirsti
jay
nut
thompsonera
sign
thru
wiz
yung
lmaoooo
leeluca
disrespect
term
mi
vintagemonro
figur
arm
purpos
deserv
you
somethin
doe
daili
pot
switch
hype
bread
playoff
activ
pet
dare
mckinley
bio
monday
automat
troll
fashion
bust
iont
gun
den
beani
breed
poppin
ago
jam
shawti
goe
milk
wifey
fear
sam
kept
almost
stevestfl
whini
jealou
subtweet
havin
felt
town
wouldv
crash
f
shop
snow
typic
costum
offic
ice
cloth
lead
fell
knee
success
brain
tyga
tylar
crush
weight
interview
ga
speak
beautifulkeezi
ignor
e
potato
classic
trippin
hour
count
throat
charg
sent
peep
squar
valentin
surpris
diss
slip
basketbal
level
lemm
dumbass
secret
paint
tabl
sloppi
whoever
besid
appreci
daughter
age
idgaf
match
matter
selfi
album
stress
solo
breakfast
bit
spread
offens
sub
bow
blast
boot
biggest
nicki
minaj
itll
book
twin
glass
grown
lilduv
valu
liter
wen
tat
group
shouldv
rihanna
hug
taken
chanc
tbh
key
stage
troubl
accid
tax
vote
jew
doctor
bone
nike
safe
coffe
massag
spa
grand
fw
spray
jean
walmart
social
soo
defens
entertain
friendli
swag
bein
ina
vet
sooo
owe
na
cold
jack
boo
struggl
doin
blood
chip
lovin
attract
grab
thirst
tall
hatin
kick
attack
parent
instagram
titl
messag
member
jame
argument
touch
sock
gift
pack
amber
buckms
buck
adult
where
punk
elect
human
countri
lone
cross
load
youd
christma
mile
nobeeetch
ferguson
egg
pollo
address
understand
dey
snitch
relat
area
truli
clear
choic
hire
huntermoor
graham
fuc
republican
less
somewher
slave
fuzzi
sweat
clam
internet
peter
alejandrobihhh
capodaasshol
rob
caption
pig
island
lyric
disgust
credit
invit
luck
join
armi
note
welcom
forreal
mrmooncricket
johnni
add
moan
magic
shame
belong
l
legal
dear
disgrac
bomb
muzzi
slay
servic
trailer
fri
corn
crew
bump
tour
statu
current
pm
fault
realiz
american
comin
hipster
spoil
nog
logic
thursday
career
roast
nick
callmerene
eyebrow
er
tough
african
lebron
plan
repli
defend
hypocrit
snack
chink
dswizzl
math
pee
pathet
btw
stole
leagu
pocket
appar
elchavaloko
twist
style
daniel
especi
stephyra
apolog
can
maniacx
border
sauc
feather
pom
nun
sexual
target
gabbi
pray
sandwich
moon
grizzboadam
wyattnuckel
standard
steveworksy
reach
crist
h
bought
yopapichulo
inch
afford
san
xdsmooth
york
moron
bigger
pair
jawshoeeahhh
judg
nyc
respond
cheer
paper
angel
guinea
cancer
wing
code
payback
p
tee
jump
thousand
stuck
stalk
twinki
pink
nail
regardless
vs
random
nyrkelsmad
episod
upset
omillz
tellin
duck
flip
debat
georg
pacdagoat
pizza
blew
constantli
lit
horni
garbag
plane
notic
martin
bee
birth
slant
lazi
camera
mickey
born
hashtag
asham
film
smokin
asleep
houston
wayn
kiefferjason
sbsylvest
addict
stare
experi
espn
bulli
gram
refus
planet
univers
recent
list
hip
winter
saturday
crowd
mcdonald
ten
abo
often
thecoreyholcomb
appear
bf
brag
jacket
vianawf
iphon
thotcho
rick
ova
outfit
scott
inkkofrosess
goodnight
flirt
http
stblocjeremiah
bookieg
cuhcuhcuh
kingtunchi
taxston